package ru.innopolis.vikkay.stc.Part1.lesson03.task03;

/**
 * Enum
 *
 * Перечень мужских имен (для генерации объектов Person)
 *
 *     @author Viktor Kochetkov
 *     @version 1.0 (07.03.2021)
*/

public enum ManNames {
    Александр,
    Михаил,
    Максим,
    Артем,
    Даниил,
    Марк,
    Иван,
    Лев,
    Дмитрий,
    Матвей,
    Роман,
    Тимофей,
    Кирилл,
    Илья,
    Никита,
    Андрей,
    Федор,
    Егор,
    Алексей,
    Мирон,
    Константин,
    Владимир,
    Ярослав,
    Мухаммад,
    Давид;
}
