package ru.innopolis.vikkay.stc.Part1.lesson03.task03;
/**
 * Enum
 *
 * Перечень женских имен (для генерации объектов Person)
 *
 *     @author Viktor Kochetkov
 *     @version 1.0 (07.03.2021)
 */

public enum WomanNames {
    София,
    Мария,
    Анна,
    Алиса,
    Виктория,
    Полина,
    Ева,
    Елизавета,
    Александра,
    Анастасия,
    Варвара,
    Дарья,
    Ксения,
    Вероника,
    Василиса,
    Арина,
    Екатерина,
    Милана,
    Кира,
    Валерия,
    Мирослава,
    Ульяна,
    Вера,
    Амина,
    Таисия;


}
