package ru.innopolis.vikkay.stc.Part1.lesson07.task02.Generate;


/**
 * класс ArrayWord
 *
 *     Задает строковый массив слов для использования в генерируемых предложениях
 *
 *
 * @version   1.0  (21.03.2021)
 * @author    Viktor Kochetkov
 *
 */

public class ArrayWord {

   public String[] getArrayWord() {
      return arrayWord;
   }

   private String [] arrayWord = {
                        "три",
                        "нет",
                        "понять",
                        "пойти",
                        "часть",
                        "спросить",
                        "город",
                        "дать",
                        "также",
                        "никто",
                        "понимать",
                        "получить",
                        "отношение",
                        "лишь",
                        "второй",
                        "именно",
                        "ваш",
                        "хотя",
                        "ни",
                        "сидеть",
                        "над",
                        "женщина",
                        "оказаться",
                        "русский",
                        "один",
                        "взять",
                        "прийти",
                        "являться",
                        "деньги",
                        "почему",
                        "вдруг",
                        "любить",
                        "стоить",
                        "почти",
                        "земля",
                        "общий",
                        "ведь",
                        "машина",
                        "однако",
                        "сразу",
                        "хорошо",
                        "вода",
                        "отец",
                        "высокий",
                        "остаться",
                        "выйти",
                        "много",
                        "проблема",
                        "начать",
                        "хороший",
                        "час",
                        "это",
                        "сегодня",
                        "право",
                        "совсем",
                        "нога",
                        "считать",
                        "главный",
                        "решение",
                        "увидеть",
                        "дверь",
                        "казаться",
                        "образ",
                        "писать",
                        "история",
                        "лучший",
                        "власть",
                        "закон",
                        "все",
                        "война",
                        "бог",
                        "голос",
                        "найти",
                        "поэтому",
                        "стоять",
                        "вообще",
                        "тысяча",
                        "больше",
                        "вместе",
                        "маленький",
                        "книга",
                        "некоторый",
                        "решить",
                        "любой",
                        "возможность",
                        "результат",
                        "ночь",
                        "стол",
                        "никогда",
                        "имя",
                        "область",
                        "молодой",
                        "пройти",
                        "например",
                        "статья",
                        "оно",
                        "число",
                        "компания",
                        "про",
                        "государственный"};

}
